app/views/shared/_comment.html.erb

<%= f.hidden_field :commenter_id, value: current_user.id %>
<%= f.submit "#{post.comments.count} comments",class:"btn btn-primar ml-1 rounded-pill"%>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]