app/views/shared/_like.html.erb

<%= f.hidden_field :user_id, value: current_user.id %>
<%= f.submit "👍 #{post.likes.count}",class:"btn btn-like"%>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]