app/views/posts/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
<div class="like-count"><%= render partial: 'shared/like_count'%></div>
<div class="comment-count"><%= image_tag  "icons8-comments-20.png" %> <span> <%=@post.comments.count%></span> </div>