app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment_content", "commenter_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_content", "hi!"], ["commenter_id", 2], ["post_id", 1], ["created_at", "2020-01-27 18:26:28.685875"], ["updated_at", "2020-01-27 18:26:28.685875"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    if @comment.save