app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.build(like_params)
    if @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2020-01-28 18:09:51.753110"], ["updated_at", "2020-01-28 18:09:51.753110"]]