app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (creator_id IN ('7,9,10,11,12') OR creator_id = 8) ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("content", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "alright this is the first post we created"], ["creator_id", 3], ["created_at", "2020-01-26 07:56:58.636149"], ["updated_at", "2020-01-26 07:56:58.636149"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save