app/controllers/requests_controller.rb

  def create
    user = User.find(params.dig(:request, :user_id))
    if current_user.friend_request.include?(user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" ORDER BY "requests"."id" DESC LIMIT $1  [["LIMIT", 1]]