app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]