app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "somaliwarsan@gmail.com"], ["LIMIT", 1]]
---
  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session['devise.facebook_data'] && session['devise.facebook_data']['extra']['raw_info']
        user.email = data['email'] if user.email.blank?
        user.first_name = data['name'] if user.first_name.blank?

SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "facebook"], ["uid", "10216102135042547"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

SELECT "posts".* FROM "posts" WHERE (creator_id IN (NULL) OR creator_id = 1) ORDER BY "posts"."created_at" DESC
---
  def feed
    friends_ids = friends.map(&:id)
    friends_ids.join(',')
    Post.where('creator_id IN (:friends_ids) OR creator_id = :user_id',
               friends_ids: friends_ids, user_id: id).to_a