app/models/user.rb

  def not_friend
    collect = []
    other = User.all.map do |user|
---
SELECT "users".* FROM "users"

  def friend_request
    receved_requests.map do |friendship|
---
SELECT "users".* FROM "users"

  def accept_request(user)
    Request.all.map do |x|
      if (x.friend_pair == "#{user.id},#{id}") || (x.friend_pair == "#{id},#{user.id}")
        return false
      end
    end
    friendship.friend_pair = "#{id},#{user.id}"
    friendship = receved_requests.find { |f| f.sender == user }
    friendship.status = true
    friends << friendship
    friendship.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", true], ["updated_at", "2020-02-02 20:12:17.257971"], ["id", 5]]

  def send_request(user)
    Request.all.map do |x|
      if (x.friend_pair == "#{user.id},#{id}") || (x.friend_pair == "#{id},#{user.id}")
        return false
      end
    end
    friend_pair = "#{id},#{user.id}"
    Request.create(recever_id: user.id, sender_id: id, friend_pair: friend_pair)
---
SELECT  "requests".* FROM "requests" ORDER BY "requests"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "requests" ("sender_id", "recever_id", "created_at", "updated_at", "friend_pair") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 13], ["recever_id", 12], ["created_at", "2020-02-03 10:03:55.631087"], ["updated_at", "2020-02-03 10:03:55.631087"], ["friend_pair", "13,12"]]

  def feed
    friends_ids = friends.map(&:id)
    friends_ids.join(',')
    Post.where('creator_id IN (:friends_ids) OR creator_id = :user_id',
               friends_ids: friends_ids, user_id: id).to_a
---
SELECT "posts".* FROM "posts" WHERE (creator_id IN ('7,9,10,11,12') OR creator_id = 8) ORDER BY "posts"."created_at" DESC